[
  {
    "bookId": 1,
    "bookName": "The Dating Playbook for Men",
    "author": "Andrew Ferebee",
    "image": "https://i.ibb.co/XLmyr1G/card-1.png",
    "review": "In 'The Dating Playbook for Men', Andrew Ferebee paints a chilling picture of a dystopian society ruled by a totalitarian regime. Set in a future where individuality is suppressed and truth is manipulated, the novel follows the protagonist Winston Smith as he rebels against the oppressive Party led by Big Brother. Orwell's stark portrayal of surveillance, propaganda, and thought control remains relevant in today's world, serving as a stark warning against the dangers of unchecked power. Through vivid imagery and thought-provoking themes, '1984' explores the consequences of sacrificing freedom for security, leaving readers questioning the nature of authority and the importance of preserving human rights.",
    "totalPages": 328,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Dystopian", "Political", "Classic"],
    "publisher": "Harvill Secker",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 2,
    "bookName": "Why Do You Hate Money?",
    "author": "JOEY PERCIA",
    "image": "https://i.ibb.co/zPyb32q/card-2.png",
    "review": "JOEY PERCIA's 'Why Do You Hate Money?' is a timeless masterpiece that confronts issues of racial injustice, morality, and compassion in the American South during the 1930s. Through the eyes of young Scout Finch, the novel delves into the complexities of human nature as her father, lawyer Atticus Finch, defends a black man wrongly accused of assaulting a white woman. Lee's poignant narrative challenges societal norms and prejudices, encouraging readers to confront their own biases and stand up for what is right. With its memorable characters and powerful message, 'To Kill a Mockingbird' continues to resonate with audiences, reminding us of the importance of empathy and understanding in the face of injustice.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Coming of Age", "Legal Drama", "Southern Gothic"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "The Hate U Give",
    "author": "ANGIE THOMAS",
    "image": "https://i.ibb.co/GxdSvcd/card-3.png",
    "review": "ANGIE THOMAS's 'The Hate U Give' is a timeless classic that captures the essence of the Jazz Age in America. Set in the affluent world of Long Island during the 1920s, the novel follows the enigmatic Jay Gatsby and his pursuit of the elusive Daisy Buchanan. Through themes of love, wealth, and the American Dream, Fitzgerald explores the emptiness and disillusionment that lurk beneath the surface of prosperity. With its lyrical prose and vivid imagery, 'The Great Gatsby' remains a poignant reflection on the fleeting nature of happiness and the consequences of obsession.",
    "totalPages": 180,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Social Commentary", "Roaring Twenties"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 4,
    "bookName": "The Scholarship Monthly Planner",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/vvmbwbL/card-4.png",
    "review": "Jane Austen's 'The Scholarship Monthly Planner' is a beloved classic that continues to enchant readers with its wit, romance, and social commentary. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and marriage in a society governed by class and propriety. Through sparkling dialogue and memorable characters, Austen explores themes of prejudice, family, and the pursuit of happiness. With its timeless appeal and enduring relevance, 'Pride and Prejudice' remains a cherished masterpiece that continues to captivate audiences around the world.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Romance", "Satire", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "Annotated Texas Family Code",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/LSn8rQL/card-5.png",
    "review": "J.D. Salinger's 'Annotated Texas Family Code' is a seminal work of American literature that captures the angst and alienation of adolescence with unmatched authenticity. Narrated by the cynical yet vulnerable Holden Caulfield, the novel follows his journey through the streets of New York City as he grapples with loss, identity, and the phoniness of the adult world. Salinger's masterful prose and keen insight into the adolescent psyche have made 'The Catcher in the Rye' a cultural touchstone, resonating with readers of all ages for generations. With its enduring relevance and universal themes, this novel continues to leave an indelible mark on literature and popular culture.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Coming of Age", "Existentialism", "American Classic"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Loving Jesus More",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/TMJ1c4d/card-6.png",
    "review": "J.R.R. Tolkien's 'Loving Jesus More' is a monumental work of fantasy that has captivated readers since its publication. Set in the richly imagined world of Middle-earth, the epic trilogy follows the quest to destroy the One Ring and defeat the dark lord Sauron. Through breathtaking adventure, rich mythology, and unforgettable characters, Tolkien explores themes of heroism, friendship, and the struggle between good and evil. With its intricate world-building and timeless storytelling, 'The Lord of the Rings' has become a cultural phenomenon, inspiring generations of readers and leaving an indelible mark on the fantasy genre.",
    "totalPages": 1178,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure", "High Fantasy"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 7,
    "bookName": "The Lost Art of Good Conversation",
    "author": "SAKYONG MIPHAM",
    "image": "https://i.ibb.co/NnCrwrv/card-7.png",
    "review": "The Lost Art of Good Conversation by SAKYONG MIPHAM is a spellbinding tale of enchantment and wonder that transports readers to a world of magic and mystery. Set in the late 19th century, the novel follows the fierce competition between two young magicians, Celia and Marco, who are bound by a magical challenge orchestrated by their mentors. As their rivalry unfolds within the confines of a magical circus that only appears at night, the lines between reality and illusion blur, and the stakes become increasingly high. Morgenstern's lush prose and vivid imagery create an immersive experience that captivates the imagination and leaves readers spellbound. The Night Circus is a mesmerizing journey into a world where dreams become reality and anything is possible.",
    "totalPages": 387,
    "rating": 4.5,
    "category": "Fantasy",
    "tags": ["Magic", "Romance", "Adventure"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 8,
    "bookName": "The Martian",
    "author": "Andy Weir",
    "image": "https://i.ibb.co/BrbrbdQ/card-8.jpg",
    "review": "The Martian by Andy Weir is a thrilling science fiction novel that combines gripping suspense with humor and ingenuity. The story follows astronaut Mark Watney, who is stranded on Mars after a mission gone wrong. Left for dead by his crewmates and with limited resources, Watney must rely on his wits and scientific knowledge to survive in the harsh Martian environment. As he struggles to find a way to communicate with Earth and await rescue, Watney's resourcefulness and determination are put to the test in the face of seemingly insurmountable odds. Weir's meticulous attention to scientific detail and Watney's irreverent wit make The Martian a riveting read that will keep you on the edge of your seat until the very end.",
    "totalPages": 369,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Survival", "Adventure", "Humor"],
    "publisher": "Crown Publishers",
    "yearOfPublishing": 2014
  },
  {
    "bookId": 9,
    "bookName": "Spin of the Dragon",
    "author": "KEBIN J. ANDERSON",
    "image": "https://i.ibb.co/d0tn9LD/card-9.png",
    "review": "Cold-Case by Donna Tartt is a sprawling and immersive novel that explores themes of art, fate, and redemption. At the center of the story is Theo Decker, who survives a tragic accident that claims his mother's life and sets him on a tumultuous journey through the underbelly of the art world. Along the way, Theo becomes entangled in a web of deception and crime, all while clinging to a small painting that holds immense sentimental value - The Goldfinch. Tartt's richly drawn characters and evocative prose bring to life a world filled with beauty and darkness, where the choices we make can shape our destinies in unexpected ways. The Goldfinch is a masterfully crafted novel that lingers in the mind long after the final page.",
    "totalPages": 771,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Art", "Coming of Age", "Mystery"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "bookId": 10,
    "bookName": "Gone Girl",
    "author": "Gillian Flynn",
    "image": "https://i.ibb.co/t3kgH80/caed-10.jpg",
    "review": "Gone Girl by Gillian Flynn is a twisted and suspenseful thriller that keeps readers guessing until the very end. On the morning of their fifth wedding anniversary, Amy Dunne disappears, leaving behind a series of cryptic clues that suggest foul play. As the investigation unfolds and secrets come to light, the lines between truth and deception blur, and nothing is as it seems. Flynn's masterful storytelling and deft characterization create a gripping narrative that keeps you on the edge of your seat, eagerly turning pages to uncover the truth. Gone Girl is a chilling exploration of marriage, identity, and the lengths we will go to for love - or revenge.",
    "totalPages": 432,
    "rating": 4.6,
    "category": "Thriller",
    "tags": ["Mystery", "Suspense", "Psychological"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2012
  },
  {
    "bookId": 11,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/jJxw9mQ/Card-11.jpg",
    "review": "The Alchemist by Paulo Coelho is a timeless fable about the journey of self-discovery and the pursuit of one's dreams. The story follows Santiago, a young shepherd who embarks on a quest to find a hidden treasure and fulfill his destiny. Along the way, he encounters a series of challenges and learns valuable lessons about life, love, and the importance of following one's heart. Coelho's simple yet profound prose resonates with readers of all ages, inspiring them to pursue their own dreams and embrace the unknown with courage and optimism. The Alchemist is a transformative tale that reminds us of the magic that lies within each of us, waiting to be discovered.",
    "totalPages": 208,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophy", "Inspiration"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 12,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/X7Qzpnq/card-12.jpg",
    "review": "The Da Vinci Code by Dan Brown is a fast-paced and thrilling adventure that combines history, mystery, and conspiracy into an exhilarating page-turner. The story follows symbologist Robert Langdon as he unravels a series of cryptic clues left behind by a murdered curator, leading him on a race against time to uncover a secret that could shake the foundations of Christianity. As Langdon delves deeper into the mysteries of the past, he finds himself caught in a web of intrigue and deception, pursued by shadowy forces determined to keep the truth hidden at any cost. Brown's intricate plotting and relentless pacing keep readers hooked from the first page to the last, making The Da Vinci Code an unforgettable read that will leave you questioning everything you thought you knew.",
    "totalPages": 489,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Conspiracy", "Mystery", "Adventure"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  }
]