[
  {
    "id": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co/x19vPhC/card-4.png",
    "review": "The Silent Patient by Alex Michaelides is a psychological thriller that grabs you from the very first page and doesn't let go until the shocking conclusion. The story revolves around Alicia Berenson, a famous painter who seemingly has it all - a loving husband, a beautiful home, and a successful career. However, everything changes when Alicia is found standing over her husband's dead body, holding a gun. From that moment on, she never speaks another word. Enter Theo Faber, a psychotherapist determined to unravel the mystery behind Alicia's silence. As Theo delves deeper into Alicia's past and psyche, he uncovers dark secrets and unexpected twists that keep the reader guessing until the final page. Michaelides skillfully weaves together a complex narrative filled with suspense, intrigue, and psychological depth. The characters are well-developed, each with their own motives and flaws that add layers of complexity to the story. The pacing is relentless, with tension building steadily throughout the book. Every chapter ends with a tantalizing cliffhanger, making it impossible to put the book down. What sets The Silent Patient apart is its jaw-dropping twist ending that will leave you reeling.  ",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Mystery",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "id": 2,
    "bookName": "The Goldfinch",
    "author": "Donna Tartt",
    "image": "https://i.ibb.co/kDySs19/card-2.png",
    "review": "The Goldfinch by Donna Tartt is a sprawling and immersive novel that explores themes of art, fate, and redemption. At the center of the story is Theo Decker, who survives a tragic accident that claims his mother's life and sets him on a tumultuous journey through the underbelly of the art world. Along the way, Theo becomes entangled in a web of deception and crime, all while clinging to a small painting that holds immense sentimental value - The Goldfinch. Tartt's richly drawn characters and evocative prose bring to life a world filled with beauty and darkness, where the choices we make can shape our destinies in unexpected ways. The Goldfinch is a masterfully crafted novel that lingers in the mind long after the final page.",
    "totalPages": 771,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Art", "Coming of Age", "Mystery"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "id": 3,
    "bookName": "Educated: A Memoir",
    "author": "Tara Westover",
    "image": "https://i.ibb.co/gwNzmFz/card-3.png",
    "review": "Educated: A Memoir is a powerful and inspiring story of resilience, courage, and the pursuit of knowledge against all odds. Tara Westover recounts her remarkable journey from growing up in a strict and abusive household in rural Idaho to eventually earning a PhD from Cambridge University. Despite facing immense challenges and obstacles, including limited access to formal education and familial estrangement, Tara's determination to educate herself and break free from the constraints of her upbringing shines through. Her story is a testament to the transformative power of education and the human spirit's capacity for growth and redemption. Educated is a deeply moving memoir that will stay with you long after you turn the final page.",
    "totalPages": 352,
    "rating": 4.8,
    "category": "Memoir",
    "tags": ["Biography", "Inspiration", "Self-discovery"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "id": 4,
    "bookName": "The Dating Playbook for Men",
    "author": "Andrew Ferebee",
    "image": "https://i.ibb.co/XLmyr1G/card-1.png",
    "review": "The Dating Playbook for Men by Andrew Ferebee is a comprehensive guide to mastering the art of dating and building meaningful connections with women. Drawing from his own experiences and insights gained from coaching thousands of men, Ferebee provides practical advice and actionable strategies for navigating the complexities of modern dating. From understanding female psychology to developing confidence and charisma, this book covers everything a man needs to know to succeed in the dating game. Ferebee's straightforward approach and emphasis on personal growth make this book not only a valuable resource for improving your dating life but also for becoming the best version of yourself. Whether you're looking for casual flings or a long-term relationship, The Dating Playbook for Men offers valuable wisdom and guidance for men of all ages and backgrounds.",
    "totalPages": 314,
    "rating": 4.7,
    "category": "Self-Help",
    "tags": ["Dating", "Relationship", "Development"],
    "publisher": "CreateSpace Independent Publishing Platform",
    "yearOfPublishing": 2015
},
  {
    "id": 5,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/VVb8fvY/card-5.jpg",
    "review": "Harper Lee's 'To Kill a Mockingbird' is a timeless masterpiece that confronts issues of racial injustice, morality, and compassion in the American South during the 1930s. Through the eyes of young Scout Finch, the novel delves into the complexities of human nature as her father, lawyer Atticus Finch, defends a black man wrongly accused of assaulting a white woman. Lee's poignant narrative challenges societal norms and prejudices, encouraging readers to confront their own biases and stand up for what is right. With its memorable characters and powerful message, 'To Kill a Mockingbird' continues to resonate with audiences, reminding us of the importance of empathy and understanding in the face of injustice.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": [ "Legal Drama", "Southern Gothic"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 6,
    "bookName": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://i.ibb.co/VBphbQ5/card-6.jpg",
    "review": "The Night Circus by Erin Morgenstern is a spellbinding tale of enchantment and wonder that transports readers to a world of magic and mystery. Set in the late 19th century, the novel follows the fierce competition between two young magicians, Celia and Marco, who are bound by a magical challenge orchestrated by their mentors. As their rivalry unfolds within the confines of a magical circus that only appears at night, the lines between reality and illusion blur, and the stakes become increasingly high. Morgenstern's lush prose and vivid imagery create an immersive experience that captivates the imagination and leaves readers spellbound. The Night Circus is a mesmerizing journey into a world where dreams become reality and anything is possible.",
    "totalPages": 387,
    "rating": 4.5,
    "category": "Fantasy",
    "tags": ["Magic", "Romance", "Adventure"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "id": 7,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/df8FNSD/card-7.jpg",
    "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a timeless classic that captures the essence of the Jazz Age in America. Set in the affluent world of Long Island during the 1920s, the novel follows the enigmatic Jay Gatsby and his pursuit of the elusive Daisy Buchanan. Through themes of love, wealth, and the American Dream, Fitzgerald explores the emptiness and disillusionment that lurk beneath the surface of prosperity. With its lyrical prose and vivid imagery, 'The Great Gatsby' remains a poignant reflection on the fleeting nature of happiness and the consequences of obsession.",
    "totalPages": 180,
    "rating": 4.7,
    "category": "Fiction",
    "tags": [ "Social Commentary", "Roaring Twenties"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "id": 8,
    "bookName": "The Martian",
    "author": "Andy Weir",
    "image": "https://i.ibb.co/BrbrbdQ/card-8.jpg",
    "review": "The Martian by Andy Weir is a thrilling science fiction novel that combines gripping suspense with humor and ingenuity. The story follows astronaut Mark Watney, who is stranded on Mars after a mission gone wrong. Left for dead by his crewmates and with limited resources, Watney must rely on his wits and scientific knowledge to survive in the harsh Martian environment. As he struggles to find a way to communicate with Earth and await rescue, Watney's resourcefulness and determination are put to the test in the face of seemingly insurmountable odds. Weir's meticulous attention to scientific detail and Watney's irreverent wit make The Martian a riveting read that will keep you on the edge of your seat until the very end.",
    "totalPages": 369,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Survival", "Adventure", "Humor"],
    "publisher": "Crown Publishers",
    "yearOfPublishing": 2014
  },
  {
    "id": 9,
    "bookName": "Spin of the Dragon",
    "author": "Kebin J. Anderson",
    "image": "https://i.ibb.co/d0tn9LD/card-9.png",
    "review": "Cold-Case by Donna Tartt is a sprawling and immersive novel that explores themes of art, fate, and redemption. At the center of the story is Theo Decker, who survives a tragic accident that claims his mother's life and sets him on a tumultuous journey through the underbelly of the art world. Along the way, Theo becomes entangled in a web of deception and crime, all while clinging to a small painting that holds immense sentimental value - The Goldfinch. Tartt's richly drawn characters and evocative prose bring to life a world filled with beauty and darkness, where the choices we make can shape our destinies in unexpected ways. The Goldfinch is a masterfully crafted novel that lingers in the mind long after the final page.",
    "totalPages": 771,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Art", "Coming of Age", "Mystery"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "id": 10,
    "bookName": "Gone Girl",
    "author": "Gillian Flynn",
    "image": "https://i.ibb.co/t3kgH80/caed-10.jpg",
    "review": "Gone Girl by Gillian Flynn is a twisted and suspenseful thriller that keeps readers guessing until the very end. On the morning of their fifth wedding anniversary, Amy Dunne disappears, leaving behind a series of cryptic clues that suggest foul play. As the investigation unfolds and secrets come to light, the lines between truth and deception blur, and nothing is as it seems. Flynn's masterful storytelling and deft characterization create a gripping narrative that keeps you on the edge of your seat, eagerly turning pages to uncover the truth. Gone Girl is a chilling exploration of marriage, identity, and the lengths we will go to for love - or revenge.",
    "totalPages": 432,
    "rating": 4.6,
    "category": "Thriller",
    "tags": ["Mystery", "Suspense", "Psychological"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2012
  },
  {
    "id": 11,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/jJxw9mQ/Card-11.jpg",
    "review": "The Alchemist by Paulo Coelho is a timeless fable about the journey of self-discovery and the pursuit of one's dreams. The story follows Santiago, a young shepherd who embarks on a quest to find a hidden treasure and fulfill his destiny. Along the way, he encounters a series of challenges and learns valuable lessons about life, love, and the importance of following one's heart. Coelho's simple yet profound prose resonates with readers of all ages, inspiring them to pursue their own dreams and embrace the unknown with courage and optimism. The Alchemist is a transformative tale that reminds us of the magic that lies within each of us, waiting to be discovered.",
    "totalPages": 208,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophy", "Inspiration"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "id": 12,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/X7Qzpnq/card-12.jpg",
    "review": "The Da Vinci Code by Dan Brown is a fast-paced and thrilling adventure that combines history, mystery, and conspiracy into an exhilarating page-turner. The story follows symbologist Robert Langdon as he unravels a series of cryptic clues left behind by a murdered curator, leading him on a race against time to uncover a secret that could shake the foundations of Christianity. As Langdon delves deeper into the mysteries of the past, he finds himself caught in a web of intrigue and deception, pursued by shadowy forces determined to keep the truth hidden at any cost. Brown's intricate plotting and relentless pacing keep readers hooked from the first page to the last, making The Da Vinci Code an unforgettable read that will leave you questioning everything you thought you knew.",
    "totalPages": 489,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Conspiracy", "Mystery", "Adventure"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  }
]